IDENTIFICATION DIVISION.
	PROGRAM-ID. datastruct.
DATA DIVISION.
	WORKING-STORAGE SECTION.
	01 EMPLOYEE-RECORD.
	05 EMPLOYEE-ID PIC 9(5).
	05 EMPLOYEE-NAME PIC X(20).
	05 EMPLOYEE-AGE PIC 99.
PROCEDURE DIVISION.
	MOVE 12345 TO EMPLOYEE-ID.
	MOVE "ALICE JONES" TO EMPLOYEE-NAME.
	MOVE 42 TO EMPLOYEE-AGE.
	DISPLAY "ID:   " EMPLOYEE-ID.
	DISPLAY "NAME: " EMPLOYEE-NAME.
	DISPLAY "AGE:  " EMPLOYEE-AGE.
	STOP RUN.
