IDENTIFICATION DIVISION.
PROGRAM-ID. TRANSFORMP.

ENVIRONMENT DIVISION.
INPUT-OUTPUT SECTION.
FILE-CONTROL.
SELECT INPUT-FILE
ASSIGN TO "INPUT.DAT"
ORGANIZATION IS LINE SEQUENTIAL.
SELECT OUTPUT-FILE
ASSIGN TO "OUTPUT.DAT"
ORGANIZATION IS LINE SEQUENTIAL.

DATA DIVISION.
FILE SECTION.
FD INPUT-FILE.
01 INPUT-RECORD.
05 IN-NAME PIC X(20).
05 IN-AGE  PIC 99.
FD OUTPUT-FILE.
01 OUTPUT-RECORD.
05 OUT-NAME PIC X(20).
05 OUT-AGE  PIC 99.
05 OUT-FLAG PIC X.
WORKING-STORAGE SECTION.
01 EOF-FLAG        PIC X VALUE "N".
01 RECORDS-READ    PIC 9(5) VALUE 0.
01 RECORDS-WRITTEN PIC 9(5) VALUE 0.

PROCEDURE DIVISION.
MAIN-PARA.
PERFORM INITIALIZE-PARA
PERFORM UNTIL EOF-FLAG = "Y"
PERFORM READ-PARA
IF EOF-FLAG = "Y"
PERFORM PROCESS-PARA
PERFORM WRITE-PARA
END-IF
END-PERFORM
PERFORM FINALIZE-PARA
STOP RUN.

INITIALIZE-PARA.
OPEN INPUT INPUT-FILE
OUTPUT OUTPUT-FILE.

READ-PARA.
READ INPUT-FILE
AT END
MOVE "Y" TO EOF-FLAG
NOT AT END
ADD 1 TO RECORDS-READ
END-READ.
	
PROCESS-PARA.
MOVE IN-NAME TO OUT-NAME
MOVE IN-AGE  TO OUT-AGE
IF IN-AGE >= 30
MOVE "Y" TO OUT-FLAG
ELSE
MOVE "N" TO OUT-FLAG
END-IF.

WRITE-PARA.
WRITE OUTPUT-RECORD
ADD 1 TO RECORDS-WRITTEN.

FINALIZE-PARA.
CLOSE INPUT-FILE OUTPUT-FILE
DISPLAY "READ:    " RECORDS-READ
DISPLAY "WRITTEN: " RECORDS-WRITTEN.

*FORCED OUTPUT NAME TO GET EXE TO BUILD 
*cobc -x -free 4B-PERFORM.cbl -o 4B-PERFORM.exe
