IDENTIFICATION DIVISION.
PROGRAM-ID. lesson31.
ENVIRONMENT DIVISION.
INPUT-OUTPUT SECTION.
FILE-CONTROL.
    SELECT INPUT-FILE
        ASSIGN TO "input.dat"
        ORGANIZATION IS LINE SEQUENTIAL.
DATA DIVISION.
FILE SECTION.
FD INPUT-FILE.
01 INPUT-RECORD.
   05 IN-NAME PIC X(20).
   05 IN-AGE  PIC 99.
WORKING-STORAGE SECTION.
01 EOF-FLAG PIC X VALUE "N".
PROCEDURE DIVISION.
DISPLAY "PROGRAM STARTED".
    OPEN INPUT INPUT-FILE.

    PERFORM UNTIL EOF-FLAG = "Y"
        READ INPUT-FILE
            AT END
                MOVE "Y" TO EOF-FLAG
            NOT AT END
                DISPLAY "NAME: " IN-NAME
                DISPLAY "AGE:  " IN-AGE
        END-READ
    END-PERFORM.

    CLOSE INPUT-FILE.
	DISPLAY "PROGRAM FINISHED - PRESS ENTER".
ACCEPT EOF-FLAG.

    STOP RUN.
