IDENTIFICATION DIVISION.
	PROGRAM-ID. SIMPLEIO.
ENVIRONMENT DIVISION.
	INPUT-OUTPUT SECTION.
FILE-CONTROL.
    SELECT INPUT-FILE
        ASSIGN TO "input.dat"
        ORGANIZATION IS LINE SEQUENTIAL.
    SELECT OUTPUT-FILE
        ASSIGN TO "output.dat"
        ORGANIZATION IS LINE SEQUENTIAL.
DATA DIVISION. 
	FILE SECTION.
	FD INPUT-FILE.
	01 INPUT-RECORD.
		05 IN-NAME PIC X(20).
		05 IN-AGE  PIC 99.
	FD OUTPUT-FILE.
	01 OUTPUT-RECORD.
		05 OUT-NAME PIC X(20).
		05 OUT-AGE  PIC 99.
	WORKING-STORAGE SECTION.
	01 RECORDS-READ    PIC 9(5) VALUE 0.
	01 RECORDS-WRITTEN PIC 9(5) VALUE 0.
	01 EOF-FLAG PIC X VALUE "N".
PROCEDURE DIVISION.
DISPLAY "PROGRAM STARTED".
DISPLAY "READING RECORD".

	OPEN INPUT INPUT-FILE
	     OUTPUT OUTPUT-FILE
	PERFORM UNTIL EOF-FLAG = "Y"
	READ INPUT-FILE
	AT END
	MOVE "Y" TO EOF-FLAG
	NOT AT END
	ADD 1 TO RECORDS-READ
DISPLAY "READ RECORD: " IN-NAME " " IN-AGE

MOVE IN-NAME TO OUT-NAME
MOVE IN-AGE  TO OUT-AGE

WRITE OUTPUT-RECORD
ADD 1 TO RECORDS-WRITTEN

	MOVE IN-NAME TO OUT-NAME
	MOVE IN-AGE TO OUT-AGE
	WRITE OUTPUT-RECORD
	END-rEAD
	END-PERFORM
	CLOSE INPUT-FILE OUTPUT-FILE
	DISPLAY "PROGRAM FINISHED".
	DISPLAY "RECORDS READ:    " RECORDS-READ.
	DISPLAY "RECORDS WRITTEN: " RECORDS-WRITTEN.

	STOP RUN.