IDENTIFICATION DIVISION.
	PROGRAM-ID. HELLOW.
ENVIRONMENT DIVISION.
DATA DIVISION.
PROCEDURE DIVISION.
	DISPLAY "My first Hello World program.".
	STOP RUN.